Repository: hanifbirgani/pep8ir
Catalog: locale/*/LC_MESSAGES/index.po
Languages: fa

source: Introduction
fa: مقدمه

source: This document gives coding conventions for the Python code comprising the standard library in the main Python distribution. Please see the companion informational PEP describing :pep:`style guidelines for the C code in the C implementation of Python <7>`.
fa: این شیوه‌نامه، نحوه نگارش کدهای پایتون و قراردادهای کدنویسی پایتون را بر اساس کتابخانه اصلی پایتون ارائه می‌دهد. لطفاً برای آگاهی از نحوه نگارش کدهای زبان C در هسته پایتون به شیوه‌نامه مرتبط با آن مراجعه کنید <7>. در این متن از واژه «پپ» (PEP) برای اشاره به استانداردهای مختلف زبان پایتون استفاده می‌شود، PEP مخفف عبارت Python Enhancement Proposal (طرح پیشنهادی بهبود پایتون) است.

source: This document and :pep:`257` (Docstring Conventions) were adapted from Guido's original Python Style Guide essay, with some additions from Barry's style guide [2]_.
fa: این راهنما و پپ ۲۵۷ (قراردادهای مستندسازی) از مقاله اصلی جناب خیدو فان روسوم [خالق پایتون] درباره نحوه نگارش کدهای پایتون و همچنین راهنمای کدنویسی آقای بری ورشو [توسعه‌دهنده گنو Mailman] الهام گرفته شده است [2]_.

source: This style guide evolves over time as additional conventions are identified and past conventions are rendered obsolete by changes in the language itself.
fa: این شیوه‌نامه با گذشت زمان، پدید آمدن قراردادهای تازه و همچنین منسوخ شدن قراردادهای پیشین تکامل می‌یابد.

source: Many projects have their own coding style guidelines. In the event of any conflicts, such project-specific guides take precedence for that project.
fa: بسیاری از پروژه‌ها راهنمای نگارش کد مخصوص به خود را دارند. در صورت بروز هر گونه تداخل بین این شیوه‌نامه و نحوه نگارش اختصاصی یک پروژه، راهنمای نگارش آن پروژه در اولویت است.

source: A Foolish Consistency is the Hobgoblin of Little Minds
fa: ثبات ناشیانه، عامل عقب‌ماندگی مغزهای کوچک است

source: One of Guido's key insights is that code is read much more often than it is written. The guidelines provided here are intended to improve the readability of code and make it consistent across the wide spectrum of Python code. As :pep:`20` says, "Readability counts".
fa: یکی از بینش‌های کلیدی خیدو این است که کدها بیش از آن که نوشته شوند، خوانده می‌شوند. نکات مطرح شده در این شیوه‌نامه برای بهبود خوانایی (قابلیت خوانده شدن) کدهای پایتون و یکدست کردن آن‌ها در طیف وسیع است. همان‌طور که در پپ ۲۰ گفته شده: «خوانایی مهم است».

source: A style guide is about consistency. Consistency with this style guide is important. Consistency within a project is more important. Consistency within one module or function is the most important.
fa: این شیوه‌نامه مستقیماً با «ثبات» در نحوه نگارش کدها مرتبط است. ثبات در این شیوه‌نامه بسیار با اهمیت است. ثباتِ درون‌پروژه‌ای از آن هم مهم‌تر است. ثبات درون یک ماژول یا یک تابع مهم‌ترین اصل است.

source: However, know when to be inconsistent -- sometimes style guide recommendations just aren't applicable. When in doubt, use your best judgment. Look at other examples and decide what looks best. And don't hesitate to ask!
fa: اما بدانید که کجا بهتر است بی‌ثبات باشید — گاهی اوقات اجرای این شیوه‌نامه امکان‌پذیر نیست. وقتی شک داشتید، وجدان خود را قاضی کنید. به دیگر نمونه کدها نگاه کنید و بر آن اساس بهترین تصمیم را بگیرید. از پرسیدن سوال نترسید!

source: In particular: do not break backwards compatibility just to comply with this PEP!
fa: به طور خاص: برای رعایت و اجرای این شیوه‌نامه، سازگاری کد با نگارش‌های پیشین [نرم‌افزار] را بر هم نزنید!

source: Some other good reasons to ignore a particular guideline:
fa: دلایل خوب دیگری برای نادیده گرفتن اصول این شیوه‌نامه:

source: When applying the guideline would make the code less readable, even for someone who is used to reading code that follows this PEP.
fa: هنگامی که بکارگیری این شیوه‌نامه باعث شود خوانایی کد پایین بیاید، حتی زمانی که خوانندهٔ کد هم از این شیوه‌نامه پیروی کند.

source: To be consistent with surrounding code that also breaks it (maybe for historic reasons) -- although this is also an opportunity to clean up someone else's mess (in true XP style).
fa: برای یکدست بودن با دیگر کدهایی که از قبل در پروژه موجود است -- هرچند این شاید فرصتی برای پاکسازی خرابکاری دیگران هم باشد.

source: Because the code in question predates the introduction of the guideline and there is no other reason to be modifying that code.
fa: کدهای موجود، قبل از بوجود آمدن این شیوه‌نامه نوشته شده‌اند و دلیل دیگری (بجز اعمال این شیوه‌نامه) برای بازنویسی آن‌ها وجود ندارد.

source: When the code needs to remain compatible with older versions of Python that don't support the feature recommended by the style guide.
fa: وقتی نیاز است کدها با نگارش‌های قدیمی پایتون سازگار باشند و نگارش‌های قدیمی پایتون از روش‌های گفته شده در این شیوه‌نامه پشتیبانی نکنند.

source: Code Lay-out
fa: چیدمان کد

source: Indentation
fa: تورفتگی

source: Use 4 spaces per indentation level.
fa: برای هر پله تورفتگی از ۴ فاصله استفاده کنید.

source: Continuation lines should align wrapped elements either vertically using Python's implicit line joining inside parentheses, brackets and braces, or using a *hanging indent* [#fn-hi]_. When using a hanging indent the following should be considered; there should be no arguments on the first line and further indentation should be used to clearly distinguish itself as a continuation line::
fa: خطوط ادامه‌دار بهتر است عناصر خود را به صورت عمودی هم‌تراز کنند، این کار می‌تواند با چیدن عناصر زیر یکدیگر درون پرانتزها، کروشه‌ها و براکت‌ها، و یا استفاده از تورفتگی‌های هم‌اندازه در خطوط اضافی انجام شود [#fn-hi]_. هنگام استفاده از تورفتگی در خطوط ادامه‌دار به این نکته توجه داشته باشید که شکل ظاهری کدها باید به گونه‌ای باشد که خوانندهٔ کد به سادگی متوجه شود این تورفتگی‌ها مربوط به شکسته شدن یک خط بلند و ادامه‌دار است.

source: The 4-space rule is optional for continuation lines.
fa: رعایت قانون ۴-فاصله برای خطوط ادامه‌دار الزامی نیست.

source: Optional::
fa: اختیاری::

source: When the conditional part of an ``if``-statement is long enough to require that it be written across multiple lines, it's worth noting that the combination of a two character keyword (i.e. ``if``), plus a single space, plus an opening parenthesis creates a natural 4-space indent for the subsequent lines of the multiline conditional. This can produce a visual conflict with the indented suite of code nested inside the ``if``-statement, which would also naturally be indented to 4 spaces. This PEP takes no explicit position on how (or whether) to further visually distinguish such conditional lines from the nested suite inside the ``if``-statement. Acceptable options in this situation include, but are not limited to::
fa: زمانی که بخش شرطی یک دستور ``if`` ترکیبی طولانی باشد، به گونه‌ای که مجبور باشیم آن را در چند خط بنویسیم، با توجه به اینکه خود دستور ``if`` از دو حرف تشکیل شده و پس از آن نیز یک فاصله و پرانتز قرار می‌گیرد، می‌توانیم خطوط اضافی شرط را با رعایت ۴ فاصله زیر خط اصلی بنویسیم. گرچه این امر سبب بوجود آمدن یک تداخل بینایی می‌شود که در نتیجه آن شرط‌های دستور ``if`` از دستورات بلوک زیر آن به سختی قابل تفکیک خواهند بود، زیرا دستورات داخل بلوک شرطی هم باید ۴ فاصله تورفتگی داشته باشند. این شیوه‌نامه توصیه خاصی برای ایجاد تمایز بین شرط‌های اصلی و دستورات درون بلوک شرطی ندارد. برخی گزینه‌های قابل قبول به شرح زیر هستند::

source: (Also see the discussion of whether to break before or after binary operators below.)
fa: (همچنین مباحث مربوط به نحوه شکستن خطوط، قبل و بعد از عملگرهای ریاضی را هم پایین‌تر ببینید.)

source: The closing brace/bracket/parenthesis on multiline constructs may either line up under the first non-whitespace character of the last line of list, as in::
fa: پرانتز/کروشه/براکت انتهایی در متغیرهای چندخطی می‌تواند زیر اولین حرف از آخرین خط نوشته شود، همانند::

source: or it may be lined up under the first character of the line that starts the multiline construct, as in::
fa: یا هم‌تراز با نام متغیر اصلی نوشته شود، همانند::

source: Tabs or Spaces?
fa: تب یا فاصله؟

source: Spaces are the preferred indentation method.
fa: برای ایجاد تورفتگی بهتر است از فاصله استفاده شود.

source: Tabs should be used solely to remain consistent with code that is already indented with tabs.
fa: استفاده از تب تنها زمانی ارجحیت دارد که بخواهیم با کدهای از پیش موجود هماهنگ شویم، یعنی کدهای قدیمی که در آن‌ها از تب برای ایجاد تورفتگی استفاده شده است.

source: Python disallows mixing tabs and spaces for indentation.
fa: پایتون ترکیب تب و فاصله برای تورفتگی را مجاز نمی‌داند.

source: Maximum Line Length
fa: بیشترین طول خط

source: Limit all lines to a maximum of 79 characters.
fa: بیشترین اندازه یک خط باید نهایتاً ۷۹ حرف باشد.

source: For flowing long blocks of text with fewer structural restrictions (docstrings or comments), the line length should be limited to 72 characters.
fa: برای بلوک‌های طولانی متن که محدودیت‌های ساختاری ندارند (مثل کامنت‌ها یا مستندات درون کد)، طول هر خط نباید از ۷۲ حرف بیشتر شود.

source: Limiting the required editor window width makes it possible to have several files open side by side, and works well when using code review tools that present the two versions in adjacent columns.
fa: رعایت طول مناسب خطوط این امکان را پدید می‌آورد که بتوان چند فایل را به صورت همزمان در کنار یکدیگر باز کرد، همانند زمانی که از ابزارهای بررسی کد برای مقایسه تغییرات یک فایل استفاده می‌کنیم.

source: The default wrapping in most tools disrupts the visual structure of the code, making it more difficult to understand. The limits are chosen to avoid wrapping in editors with the window width set to 80, even if the tool places a marker glyph in the final column when wrapping lines. Some web based tools may not offer dynamic line wrapping at all.
fa: شکستن خطوط به صورت خودکار در بسیاری از نرم‌افزارهای کدنویسی باعث برهم خوردن ساختار کدها و فهم سخت‌تر کد می‌شود. این محدودیت‌ها برای این انتخاب شده‌اند که در نرم‌افزارهایی که عرض پنجره آن‌ها حداقل ۸۰ کاراکتر است، از شکستن خودکار خطوط جلوگیری شود. هرچند برخی نرم‌افزارهای کدنویسی به صورت کلی شکستن خطوط را اعمال نمی‌کنند.

source: Some teams strongly prefer a longer line length. For code maintained exclusively or primarily by a team that can reach agreement on this issue, it is okay to increase the line length limit up to 99 characters, provided that comments and docstrings are still wrapped at 72 characters.
fa: برخی تیم‌ها ممکن است اندازه خطوط طولانی‌تر را ترجیح دهند. در صورت توافق اعضای تیم، برای کدهایی که فقط توسط خود تیم خوانده و نگهداری می‌شوند، طول هر خط می‌تواند تا ۹۹ حرف هم در نظر گرفته شود. اما در این حالت هم تعداد حروف کامنت‌ها و مستندات نباید از ۷۲ حرف بیشتر شود.

source: The Python standard library is conservative and requires limiting lines to 79 characters (and docstrings/comments to 72).
fa: کتابخانه استاندارد پایتون بسیار محافظه‌کار است و لازم است که تمام خطوط آن کمتر از ۷۹ حرف باشند. همچنین کامنت‌ها و مستندات باید کمتر از ۷۲ حرف باشند.

source: The preferred way of wrapping long lines is by using Python's implied line continuation inside parentheses, brackets and braces. Long lines can be broken over multiple lines by wrapping expressions in parentheses. These should be used in preference to using a backslash for line continuation.
fa: روش ترجیحی برای شکستن خطوط طولانی، استفاده از خط ادامه‌دار ضمنی پایتون داخل پرانتزها، کروشه‌ها و آکولادهاست. با شکستن عبارات داخل پرانتزها، می توان خطوط طولانی را به چندین خط تقسیم کرد. این روش برای شکستن خطوط بلند، به جای استفاده از بک‌اسلش، اولویت دارد.

source: Backslashes may still be appropriate at times. For example, long, multiple ``with``-statements could not use implicit continuation before Python 3.10, so backslashes were acceptable for that case::
fa: گاهی اوقات بک‌اسلش‌ها می‌توانند کارآمد باشند. برای مثال پیش از پایتون ۳٫۱۰، برخی از دستورات ``with`` که ممکن است طولانی و چندگانه باشند را می‌توان با کمک بک‌اسلش ساده‌تر و خواناتر نوشت.

source: (See the previous discussion on `multiline if-statements`_ for further thoughts on the indentation of such multiline ``with``-statements.)
fa: (درباره عبارت ``with`` چندخطی، می‌توانید مباحث پیشین در ارتباط با دستورات شرطی چندخطی `multiline if-statements`_ مطالعه کنید.)

source: Another such case is with ``assert`` statements.
fa: مورد دیگر با دستور ``assert`` است.

source: Make sure to indent the continued line appropriately.
fa: مطمئن شوید که تورفتگی خطوط ادامه‌دار را رعایت کنید.

source: Should a Line Break Before or After a Binary Operator?
fa: خطوط باید بعد از عملگرهای ریاضی شکسته شوند یا قبل از آن‌ها؟

source: For decades the recommended style was to break after binary operators. But this can hurt readability in two ways: the operators tend to get scattered across different columns on the screen, and each operator is moved away from its operand and onto the previous line. Here, the eye has to do extra work to tell which items are added and which are subtracted::
fa: برای سال‌ها، روش پیشنهادی این بود که خطوط بعد از عملگرهای ریاضی شکسته شوند؛ اما این کار به دو دلیل باعث پایین آمدن خوانایی کدها می‌شود: عملگرها در ستون‌های مختلفِ کد پراکنده می‌شوند، و هر عملگر از دستورات مربوط به خود دور شده و در خط قبل قرار می‌گیرد. برای نمونه در کد زیر، چشم انسان مجبور است کار بیشتری انجام دهد تا متوجه شویم کدام عبارت قرار است اضافه شود و کدام یک کم شود::

source: To solve this readability problem, mathematicians and their publishers follow the opposite convention. Donald Knuth explains the traditional rule in his *Computers and Typesetting* series: "Although formulas within a paragraph always break after binary operations and relations, displayed formulas always break before binary operations" [3]_.
fa: برای حل مشکل خوانایی کدها، جامعه ریاضیدان‌ها روش متفاوتی برگزیدند. دانلد نات در مجموعه کتاب‌های *کامپیوترها و حروف‌چینی* روش سنتی را این‌گونه شرح می‌دهد: ‌‌"گرچه فرمول‌های درون هر پاراگراف بعد از عملگر ریاضی شکسته می‌شوند، اما هنگام نمایش مناسب، این فرمول‌ها باید قبل از عملگرها شکسته شوند" [3]_.

source: Following the tradition from mathematics usually results in more readable code::
fa: پیروی از سبک نگارش قدیمی ریاضیات معمولا باعث نتیجه بهتری در نمایش کدها می‌شود::

source: In Python code, it is permissible to break before or after a binary operator, as long as the convention is consistent locally. For new code Knuth's style is suggested.
fa: در کدنویسی پایتون مادامی که یکدست بودن کدها رعایت شود و همیشه از یک قاعده پیروی شود، هر دو روش فوق، مجاز و قابل استفاده هستند. هر چند برای کدهایی که تازه نوشته می‌شوند، پیشنهاد می‌شوند از روش دانلد نات (شکستن خطوط قبل از عملگر) استفاده شود.

source: Blank Lines
fa: خطوط خالی

source: Surround top-level function and class definitions with two blank lines.
fa: قبل از تعریف توابع سطح بالا و کلاس‌ها از دو خط خالی استفاده کنید.

source: Method definitions inside a class are surrounded by a single blank line.
fa: قبل از تعریف متدها درون کلاس، از یک خط خالی استفاده کنید.

source: Extra blank lines may be used (sparingly) to separate groups of related functions. Blank lines may be omitted between a bunch of related one-liners (e.g. a set of dummy implementations).
fa: در مواردی معدود می‌توان برای گروه‌بندی توابع مرتبط با هم، و جداسازی این گروه‌ها از یکدیگر، از خطوط خالی اضافه استفاده کرد. خطوط خالی را می‌توان از بین دستورات یک‌خطی مرتبط با هم حذف کرد (برای مثال در پیاده‌سازی تست‌های ساختگی).

source: Use blank lines in functions, sparingly, to indicate logical sections.
fa: در توابع بهتر است صرفاً برای جدا کردن بخش‌های منطقی، از خطوط خالی استفاده کنید.

source: Python accepts the control-L (i.e. ^L) form feed character as whitespace; Many tools treat these characters as page separators, so you may use them to separate pages of related sections of your file. Note, some editors and web-based code viewers may not recognize control-L as a form feed and will show another glyph in its place.
fa: پایتون از کاراکتر کنترلی control-L (یا L^) برای ایجاد فضای خالی استفاده می‌کند؛ بسیاری از ابزارها این کاراکترها را تفکیک کننده صفحه تلقی می‌کنند، که می‌توانید از آنها برای تفکیک کردن صفحات بخش‌های مرتبط با هم در فایل خود استفاده کنید. توجه کنید که بعضی از ویرایشگرها و نمایشگرهای کد مبتنی بر وب ممکن است control-L را به عنوان کاراتر کنترلی تفکیک کننده صفحه تشخیص ندهند و به جای آن یک عملکرد دیگر از خود نشان دهند.

source: Source File Encoding
fa: کدبندی فایل

source: Code in the core Python distribution should always use UTF-8, and should not have an encoding declaration.
fa: کدهای هستهٔ پایتون همیشه باید از UTF-8 استفاده کنند، و نباید خط اعلام رمزگذاری داشته باشند.

source: In the standard library, non-UTF-8 encodings should be used only for test purposes. Use non-ASCII characters sparingly, preferably only to denote places and human names. If using non-ASCII characters as data, avoid noisy Unicode characters like z̯̯͡a̧͎̺l̡͓̫g̹̲o̡̼̘ and byte order marks.
fa: در کتابخانه استاندارد، رمزگذاری‌های غیر UTF-8 فقط باید برای اهداف آزمایشی استفاده شوند. از کاراکترهای غیر ASCII کمتر استفاده کنید، ترجیحاً فقط برای نشان دادن نام مکان‌ها و انسان‌ها. اگر از کاراکترهای غیر ASCII به عنوان داده استفاده می‌کنید، از کاراکترهای یونیکد شلوغ مانند z̯̯͡a̧͎̺l̡͓̫g̹̲o̡̼̘ و علامت‌های ترتیب بایت خودداری کنید.

source: All identifiers in the Python standard library MUST use ASCII-only identifiers, and SHOULD use English words wherever feasible (in many cases, abbreviations and technical terms are used which aren't English).
fa: تمام شناسه‌ها (نام یک متغیر، تابع، ماژول و ...) در کتابخانه استاندارد پایتون باید فقط از نوع ASCII باشند و باید تا آنجا که امکان دارد از کلمات انگلیسی استفاده کنند (در بسیاری از موارد، از برخی اختصارات و اصطلاحات فنی استفاده می‌شود که انگلیسی نیستند).

source: Open source projects with a global audience are encouraged to adopt a similar policy.
fa: پیشنهاد می‌شود پروژه‌های بازمتنی که مخاطب جهانی دارند هم از سیاست مشابهی استفاده کنند.

source: Imports
fa: ایمپورت

source: Imports should usually be on separate lines::
fa: ایمپورت‌ها بهتر است در خطوط جداگانه باشند::

source: It's okay to say this though::
fa: مشکلی ندارد اگر بگوییم::

source: Imports are always put at the top of the file, just after any module comments and docstrings, and before module globals and constants.
fa: ایمپورت‌ها همیشه در ابتدای فایل نوشته می‌شوند، درست پس از کامنت‌ها، مستندات ماژول و قبل از تعریف متغیرها و ثابت‌ها.

source: Imports should be grouped in the following order:
fa: ایمپورت‌ها باید به ترتیب زیر گروه‌بندی شوند:

source: Standard library imports.
fa: ایمپورت‌های کتابخانه استاندارد.

source: Related third party imports.
fa: ایمپورت کتابخانه‌های شخص ثالث.

source: Local application/library specific imports.
fa: ایمپورت کتابخانه‌ها و کدهای محلی (local).

source: You should put a blank line between each group of imports.
fa: شما باید بین هر گروه از ایمپورت‌ها یک خط خالی قرار دهید.

source: Absolute imports are recommended, as they are usually more readable and tend to be better behaved (or at least give better error messages) if the import system is incorrectly configured (such as when a directory inside a package ends up on ``sys.path``)::
fa: پیشنهاد می شود ایمپورت‌ها به صورت مطلق انجام شوند، زیرا معمولا خواناتر هستند و در صورت پیکربندی نادرست سیستم ایمپورت (مانند زمانی که یک دایرکتوری داخل یک بسته به ``sys.path`` ختم می شود) رفتار مناسب از خود نشان می دهند ( یا حداقل پیغام های خطای بهتری نمایش می دهند)::

source: However, explicit relative imports are an acceptable alternative to absolute imports, especially when dealing with complex package layouts where using absolute imports would be unnecessarily verbose::
fa: با این حال، ایمپورت‌های نسبی صریح، جایگزین قابل قبولی برای ایمپورت‌های مطلق هستند، بخصوص زمانی که با ترتیب پیچیده بسته‌ها سروکار داریم که استفاده از ایمپورت‌های مطلق، غیرضروری، شلوغ و ناخوانا خواهد بود::

source: Standard library code should avoid complex package layouts and always use absolute imports.
fa: کدهای کتابخانه استاندارد باید از ایمپورت کردن به صورت لایه‌های پیچیده اجتناب کنند و همیشه از ایمپورت‌های مطلق استفاده کنند.

source: When importing a class from a class-containing module, it's usually okay to spell this::
fa: هنگام ایمپورت یک کلاس از ماژولی که شامل کلاس‌های مختلف است، می‌توانیم از الگوی زیر استفاده کنیم::

source: If this spelling causes local name clashes, then spell them explicitly::
fa: اگر کلاس‌ها یا توابعی که در یک فایل ایمپورت می‌کنید با نام‌های موجود در آن فایل تداخل دارند، بهتر است آن‌ها را صریحاً به صورت زیر بنویسید::

source: and use "myclass.MyClass" and "foo.bar.yourclass.YourClass".
fa: و از "myclass.MyClass" و "foo.bar.yourclass.YourClass" استفاده کنید.

source: Wildcard imports (``from <module> import *``) should be avoided, as they make it unclear which names are present in the namespace, confusing both readers and many automated tools. There is one defensible use case for a wildcard import, which is to republish an internal interface as part of a public API (for example, overwriting a pure Python implementation of an interface with the definitions from an optional accelerator module and exactly which definitions will be overwritten isn't known in advance).
fa: از ایمپورت‌های عمومی (استفاده از سمبل‌های جمع مانند ”*” در ``from <module> import *``) باید اجتناب شود، زیرا آن‌ها باعث می‌شوند واضح نباشد که چه نام‌هایی در فضانام موجود هستند، این مسئله باعث گیج شدن خواننده و بسیاری از ابزارهای خودکار می‌شود. فقط یک دلیل قابل دفاع در استفاده از ایمپورت‌های عمومی وجود دارد: بازنشر یک رابط داخلی به عنوان بخشی از یک API عمومی ( برای نمونه، بازنویسی یک پیاده‌سازی پایتون خالص از یک رابط با تعاریفی اختیاری از یک ماژول شتابدهنده و اینکه دقیقا از قبل مشخص نشده است کدام تعاریف بازنویسی می‌شوند).

source: When republishing names this way, the guidelines below regarding public and internal interfaces still apply.
fa: هنگام بازنشر نام‌ها به این روش ، دستورالعمل‌های زیر در مورد رابط‌های عمومی و داخلی همچنان اعمال می‌شوند.

source: Module Level Dunder Names
fa: داندرهای سطح ماژول

source: Module level "dunders" (i.e. names with two leading and two trailing underscores) such as ``__all__``, ``__author__``, ``__version__``, etc. should be placed after the module docstring but before any import statements *except* ``from __future__`` imports. Python mandates that future-imports must appear in the module before any other code except docstrings::
fa: داندرها، متغیر/متدهایی هستند که نام آن‌ها با دو زیرخط آغاز شده و با دو زیرخط خاتمه می‌یابد، مانند ``__all__``، ``__author__``، ``__version__``. داندرهای در سطح ماژول باید پس از مستندات ماژول، و قبل از ایمپورت‌ها نوشته شوند، *به استثنای* ایمپورت‌های ``from __future__``. پایتون ما را ملزم می‌کند که ایمپورت‌های ``from __future__`` را در ابتدای ماژول، قبل از هر کد دیگری قرار دهیم.

source: String Quotes
fa: علامت‌های نقل قول در رشته‌ها

source: In Python, single-quoted strings and double-quoted strings are the same. This PEP does not make a recommendation for this. Pick a rule and stick to it. When a string contains single or double quote characters, however, use the other one to avoid backslashes in the string. It improves readability.
fa: در پایتون نقل قول‌های تکی (') و دوتایی (") هنگام کار با رشته‌ها تفاوتی ندارند. در این شیوه‌نامه برای این مورد پیشنهادی ارائه نمی‌شود. شما یک کدام از این دو را به عنوان قانون کد زنی برای خود انتخاب کنید و با آن ادامه دهید. برای مثال اگر در یک جمله از نقل قول تکی استفاده شده است، شما آن رشته را در یک نقل قول دوتایی قرار دهید تا از بک اسلش در رشته‌ی خود برای تفکیک علامت نقل قول استفاده نکنید. این عمل باعث افزایش خوانایی کد شما می‌شود.

source: For triple-quoted strings, always use double quote characters to be consistent with the docstring convention in :pep:`257`.
fa: هنگام تعریف رشته‌های سه گانه، از نقل قول‌هایی دوتایی به صورت (\"\"\") استفاده کنید تا مطابق با قرارداد نوشتن مستندات کد در پپ ۲۵۷ باشد.

source: Whitespace in Expressions and Statements
fa: فضاهای خالی در عبارات و دستورات

source: Pet Peeves
fa: موارد روی اعصاب

source: Avoid extraneous whitespace in the following situations:
fa: از گذاشتن فضای خالی (فاصله) در موقعیت‌های زیر خودداری کنید:

source: Immediately inside parentheses, brackets or braces::
fa: بعد از باز کردن پرانتز، کروشه و براکت؛ همچنین قبل از بستن آن‌ها::

source: Between a trailing comma and a following close parenthesis::
fa: بعد از ویرگول انتهایی و قبل از بستن پرانتز::
