Repository: hanifbirgani/pep8ir
Catalog: locale/*/LC_MESSAGES/index.po
Languages: fa

source: For sequences, (strings, lists, tuples), use the fact that empty sequences are false::
fa: برای نوع داده‌هایی که دارای ترتیب هستند (رشته‌ها، لیست‌ها و تاپل‌ها)، به این واقعیت اتکا کنید که مقادیر خالی آن‌ها غلط هستند::

source: Don't write string literals that rely on significant trailing whitespace. Such trailing whitespace is visually indistinguishable and some editors (or more recently, reindent.py) will trim them.
fa: حروف رشته‌ای که متکی به فضای خالی انتهایی قابل توجهی هستند را ننویسید. چنین فضای خالی انتهایی از نظر بصری قابل تشخیص نیست و برخی از ویرایشگرها (یا اخیراً، reindent.py) آنها را حذف می‌کنند.

source: Don't compare boolean values to True or False using ``==``::
fa: مقادیر بولی را با استفاده از ``==`` با True و False مقایسه نکنید::

source: Worse::
fa: بدترین::

source: Use of the flow control statements ``return``/``break``/``continue`` within the finally suite of a ``try...finally``, where the flow control statement would jump outside the finally suite, is discouraged. This is because such statements will implicitly cancel any active exception that is propagating through the finally suite::
fa: استفاده از عبارات کنترل جریان ``return``/``break``/``continue`` در سلسله نهایی ساختار ``try...finally``، جایی که دستور کنترل جریان به خارج از سلسله نهایی می‌پرد، کارایی ندارد. دلیل این امر این است که چنین عباراتی به طور ضمنی هر استثنا فعالی را که در سلسله نهایی رخ می‌دهد، لغو می‌کنند::

source: Function Annotations
fa: انوتیشن‌های توابع

source: With the acceptance of :pep:`484`, the style rules for function annotations have changed.
fa: با پذیرش پپ ۴۸۴ شیوه نگارش انوتیشن توابع تغییر کرد.

source: Function annotations should use :pep:`484` syntax (There are some formatting recommendations for annotations in the previous section).
fa: انوتیشن‌های توابع باید مطابق با شیوه‌نامه پپ ۴۸۴ باشند. (در بخش قبل، برخی اصول پیشنهادی برای انوتیشن‌ها آورده شده).

source: The experimentation with annotation styles that was recommended previously in this PEP is no longer encouraged.
fa: استفاده‌های آزمایشی از انوتیشن‌ها که در نسخه‌های پیشین پپ ۸ گفته شده بود از این به بعد پیشنهاد نمی‌شود.

source: However, outside the stdlib, experiments within the rules of :pep:`484` are now encouraged. For example, marking up a large third party library or application with :pep:`484` style type annotations, reviewing how easy it was to add those annotations, and observing whether their presence increases code understandability.
fa: با این حال اکنون، آزمایش قوانین پپ ۴۸۴ خارج از کتابخانه استاندارد نیز پیشنهاد می‌شوند. برای نمونه، علامت‌گذاری یک کتابخانه یا برنامه شخص ثالث بزرگ با سبک انوتیشن‌های پپ ۴۸۴، بررسی آسان بودن افزودن آن انوتیشن‌ها، و مشاهده اینکه آیا وجود آنها درک کد را افزایش می دهد یا خیر.

source: The Python standard library should be conservative in adopting such annotations, but their use is allowed for new code and for big refactorings.
fa: کتابخانه استاندارد پایتون باید در پذیرش چنین انوتیشن‌هایی محافظه‌کار باشد، اما استفاده از آن‌ها برای کدهای جدید و بازسازی‌های بزرگ کدها مجاز است.

source: For code that wants to make a different use of function annotations it is recommended to put a comment of the form::
fa: برای کدهایی که می‌خواهند استفادهٔ دیگری از انوتیشن‌های تابع داشته باشند، پیشنهاد می‌شود از کامنت‌هایی با فرم زیر استفاده شود::

source: near the top of the file; this tells type checkers to ignore all annotations. (More fine-grained ways of disabling complaints from type checkers can be found in :pep:`484`.)
fa: در خطوط اولیهٔ فایل؛ این خط به چک‌کننده‌های تایپ‌ها پیغام می‌دهد که انوتیشن‌ها را در این فایل نادیده بگیرند. (برای دیدن روش‌های دیگر غیرفعال کردن انوتیشن‌ها به پپ ۴۸۴ مراجعه کنید).

source: Like linters, type checkers are optional, separate tools. Python interpreters by default should not issue any messages due to type checking and should not alter their behavior based on annotations.
fa: مانند لینترها، چک‌کننده‌های نوع داده اختیاری هستند و ابزارهایی جدا به حساب می‌آیند. مفسرهای پایتون به طور پیش‌فرض نباید هیچ پیامی را به دلیل بررسی نوع داده نشان دهند و نباید رفتار خود را بر اساس انوتیشن‌ها تغییر دهند.

source: Users who don't want to use type checkers are free to ignore them. However, it is expected that users of third party library packages may want to run type checkers over those packages. For this purpose :pep:`484` recommends the use of stub files: .pyi files that are read by the type checker in preference of the corresponding .py files. Stub files can be distributed with a library, or separately (with the library author's permission) through the typeshed repo [5]_.
fa: کاربرانی که نمی‌خواهند از چک‌کننده‌های نوع داده استفاده کنند، می‌توانند آن‌ها را نادیده بگیرند. با این حال، انتظار می‌رود که کاربران بسته‌های کتابخانه شخص ثالث ممکن است بخواهند بررسی‌های نوع داده را روی آن بسته‌ها انجام دهند. برای این منظور پپ ۴۸۴ استفاده از فایل‌های خرد (stub files) را توصیه می‌کند: فایل‌های .pyi که توسط چک‌کننده نوع داده در اولویت فایل‌های .py مربوطه خوانده می‌شوند. فایل‌های خرد را می‌توان با کتابخانه، یا به صورت جداگانه (با اجازه نویسنده کتابخانه) از طریق مخزن typeshed [5]_ توزیع کرد.

source: Variable Annotations
fa: انوتیشن‌های متغیرها

source: :pep:`526` introduced variable annotations. The style recommendations for them are similar to those on function annotations described above:
fa: پپ ۲۵۶ انوتیشن‌های متغیر را معرفی کرد. شیوه‌نامه پیشنهادی شامل قانون‌های مشابه با انوتیشن توابع است که بالاتر توضیح داده شد:

source: Annotations for module level variables, class and instance variables, and local variables should have a single space after the colon.
fa: انوتیشن برای متغیرهای سطح ماژول، کلاس و متغیرهای داخلی کلاس و متغیرهای محلی باید یک فاصله بعد از دونقطه داشته باشند.

source: There should be no space before the colon.
fa: هیچ فاصله‌ای نباید پیش از دونقطه قرار بگیرد.

source: If an assignment has a right hand side, then the equality sign should have exactly one space on both sides::
fa: هنگام تخصیص مقدار به یک متغیر، باید قبل و بعد از علامت ``=`` یک فاصله قرار بگیرد::

source: Although the :pep:`526` is accepted for Python 3.6, the variable annotation syntax is the preferred syntax for stub files on all versions of Python (see :pep:`484` for details).
fa: هرچند پپ ۵۲۶ برای پایتون ۳,۶ پذیرفته شده است، ساختار انوتیشن متغیرها، ساختار ترجیح داده شده برای فایل‌های stub در تمام نگارش‌های پایتون است (برای جزئیات بیشتر پپ ۴۸۴ را ببینید).

source: Footnotes
fa: پانویس‌ها

source: *Hanging indentation* is a type-setting style where all the lines in a paragraph are indented except the first line. In the context of Python, the term is used to describe a style where the opening parenthesis of a parenthesized statement is the last non-whitespace character of the line, with subsequent lines being indented until the closing parenthesis.
fa: *تورفتگی آویزان* یک سبک چیدن حروف است که در آن تمام خطوط یک پاراگراف به جز خط اول تورفتگی دارند. در پایتون، این اصطلاح برای توصیف سبکی استفاده می‌شود که در آن پرانتز آغازین یک عبارتِ پرانتزشده، آخرین کاراکترِ یک خط است، و خطوط بعدی تا پرانتز پایانی تورفتگی دارند.

source: References
fa: منابع

source: Barry's GNU Mailman style guide http://barry.warsaw.us/software/STYLEGUIDE.txt
fa: شیوه‌نامه نگارش گنو میل‌من https://bit.ly/3wZ7J5I

source: Donald Knuth's *The TeXBook*, pages 195 and 196.
fa: دانلد ناتس *The TeXBook*، صفحات ۱۹۵ و ۱۹۶.

source: http://www.wikipedia.com/wiki/CamelCase
fa: https://bit.ly/2TinGp5

source: Typeshed repo https://github.com/python/typeshed
fa: مخزن تایپشد https://github.com/python/typeshed

source: Copyright
fa: کپی‌رایت

source: This document has been placed in the public domain.
fa: این شیوه‌نامه به صورت آزاد در دسترس همگان قرار گرفته است.
