Repository: hanifbirgani/pep8ir
Catalog: locale/*/LC_MESSAGES/index.po
Languages: fa

source: Use the function naming rules: lowercase with words separated by underscores as necessary to improve readability.
fa: از اصول نام‌گذاری تابع پیروی کنید: کلماتی با حروف کوچک که به وسیله زیرخط از هم جدا شده‌اند تا خوانایی بالاتر برود.

source: Use one leading underscore only for non-public methods and instance variables.
fa: از زیرخط ابتدای کلمات فقط برای متدهای غیرعمومی و متغیرهای داخلی کلاس استفاده کنید.

source: To avoid name clashes with subclasses, use two leading underscores to invoke Python's name mangling rules.
fa: برای جلوگیری از تداخل نام‌ها با زیرکلاس‌ها، با استفاده از قوانین دستکاری نام‌ها در پایتون، از دو زیرخط در اول نام‌ها استفاده کنید.

source: Python mangles these names with the class name: if class Foo has an attribute named ``__a``, it cannot be accessed by ``Foo.__a``. (An insistent user could still gain access by calling ``Foo._Foo__a``.) Generally, double leading underscores should be used only to avoid name conflicts with attributes in classes designed to be subclassed.
fa: پایتون نام کلاس را به این نام‌ها می‌چسباند: اگر کلاس Foo مشخصه‌ای به نام ``__a`` دارد، نمی‌توان با ‍‍‍‍‍‍‍``Foo.__a`` به آن دسترسی پیدا کرد. (اگر مصر به دسترسی به آن هستید باید از عبارت ``Foo._Foo__a`` استفده کنید.) به طور کل، استفاده از دو زیرخط اول فقط باید برای جلوگیری از تداخل نام‌ها با نام مشخصه‌های کلاس‌هایی که زیرکلاس هستند، استفاده شوند.

source: Note: there is some controversy about the use of __names (see below).
fa: نکته: اختلاف نظرهایی در مورد استفاده از ``__names`` وجود دارد (برای اطلاعات بیشتر پایین‌تر را بخوانید).

source: Constants
fa: ثابت‌ها

source: Constants are usually defined on a module level and written in all capital letters with underscores separating words. Examples include ``MAX_OVERFLOW`` and ``TOTAL``.
fa: ثابت‌ها معمولاً در سطح ماژول تعریف می‌شوند و تماماً با حروف بزرگ نوشته شده و کلمات آن‌ها با زیرخط از هم جدا می‌شوند. برای نمونه می‌توان ثابت‌هایی با نام ``MAX_OVERFLOW`` و ``TOTAL`` تعریف کرد.

source: Designing for Inheritance
fa: طراحی برای ارث‌بری

source: Always decide whether a class's methods and instance variables (collectively: "attributes") should be public or non-public. If in doubt, choose non-public; it's easier to make it public later than to make a public attribute non-public.
fa: همیشه تصمیم بگیرید که کدام متدها و متغیرهای داخلی کلاس (به صورت کلی، مشخصه‌های کلاس) باید عمومی و کدام یک غیرعمومی باشند. هرگاه شک داشتید، گزینه غیرعمومی را انتخاب کنید؛ زیرا تبدیل کردن یک مشخصه غیرعمومی به عمومی، ساده‌تر از تبدیل یک مشخصه عمومی به غیرعمومی است.

source: Public attributes are those that you expect unrelated clients of your class to use, with your commitment to avoid backwards incompatible changes. Non-public attributes are those that are not intended to be used by third parties; you make no guarantees that non-public attributes won't change or even be removed.
fa: مشخصه‌های عمومی آن دسته از مشخصه‌های کلاس هستند که شما انتظار دارید مصرف‌کنندگان آن کلاس بتوانند از آن‌ها استفاده کنند و همچنین شما تضمین می‌دهید که از انجام تغییرات ناسازگار [با نگارش‌های پیشین نرم‌افزار] در آن‌ها جلوگیری کنید. مشخصه‌های غیرعمومی آن‌هایی هستند که قرار نیست از بیرون استفاده شوند و شما تعهدی برای عدم حذف یا عدم تغییر آن‌ها ندارید.

source: We don't use the term "private" here, since no attribute is really private in Python (without a generally unnecessary amount of work).
fa: اینجا ما از عبارت «خصوصی» استفاده نمی‌کنیم، به این دلیل که هیچ مشخصه‌ای در پایتون واقعاً خصوصی نیست.

source: Another category of attributes are those that are part of the "subclass API" (often called "protected" in other languages). Some classes are designed to be inherited from, either to extend or modify aspects of the class's behavior. When designing such a class, take care to make explicit decisions about which attributes are public, which are part of the subclass API, and which are truly only to be used by your base class.
fa: دسته‌ی دیگر مشخصه‌های کلاس آنهایی هستند که بخشی از "زیرکلاس واسط برنامه‌نویسی" (subclass API) هستند (اغلب در دیگر زبان های برنامه‌نویسی به آن‌ها "حفاظت شده" (protected) گفته می‌شود). برخی از کلاس‌ها به گونه‌ای طراحی شده‌اند که از آن‌ها ارث‌بری شود، یا بخش‌هایی از رفتارشان گسترش یا تغییر پیدا کند. هنگام طراحی چنین کلاسی، مواظب تصمیم‌های صریح درباره‌ی اینکه کدام مشخصه‌ها عمومی هستند، کدامشان بخشی از زیرکلاس واسط برنامه‌نویسی و کدامشان فقط قرار است توسط کلاس پایه شما استفاده شود، باشید.

source: With this in mind, here are the Pythonic guidelines:
fa: با در نظر داشتن این نکات، راهنمای پایتونی انجام کار به این صورت است:

source: Public attributes should have no leading underscores.
fa: مشخصه‌های عمومی نباید با زیرخط (underscore) شروع شوند.

source: If your public attribute name collides with a reserved keyword, append a single trailing underscore to your attribute name. This is preferable to an abbreviation or corrupted spelling. (However, notwithstanding this rule, 'cls' is the preferred spelling for any variable or argument which is known to be a class, especially the first argument to a class method.)
fa: اگر نام مشخصه‌های عمومی شما با کلیدواژه‌های از پیش رزرو شده تداخل دارد، یک زیرخط به ابتدای نام مشخصهٔ خود اضافه کنید. این کار نسبت به استفاده از یک مخفف یا یک املای خراب شده ترجیح داده می‌شود. (با این حال و با وجود این قوانین، املای 'cls' برای هر متغیر یا آرگومانی که می‌تواند یک کلاس باشد ترجیح داده می‌شود؛ خصوصاً اگر آرگومان اول یک کلاس‌متد باشد.)

source: Note 1: See the argument name recommendation above for class methods.
fa: نکته ۱: برای کلاس‌متدها به توصیه‌های نام‌گذاری آرگومان‌ها در بالا دقت کنید.

source: For simple public data attributes, it is best to expose just the attribute name, without complicated accessor/mutator methods. Keep in mind that Python provides an easy path to future enhancement, should you find that a simple data attribute needs to grow functional behavior. In that case, use properties to hide functional implementation behind simple data attribute access syntax.
fa: برای مشخصه‌های دادهٔ عمومی ساده، بهتر است فقط نام مشخصه، بدون روش‌های پیچیدهٔ کمک‌کننده نمایش داده شود. به خاطر داشته باشید، پایتون مسیر بهبود رفتار عملکردی مشخصه‌های داده را در آینده همیشه هموار نگاه می‌دارد. برای این کار، از ویژگی‌های کلاس استفاده کنید تا پیاده سازی عملکردی را در پشت مشخصهٔ داده، پنهان کنید.

source: Note 1: Try to keep the functional behavior side-effect free, although side-effects such as caching are generally fine.
fa: نکته ۱: سعی کنید رفتار توابع بدون عوارض جانبی باشد. اگرچه برخی عوارض جانبی همچون کشینگ معمولاً خوب هستند.

source: Note 2: Avoid using properties for computationally expensive operations; the attribute notation makes the caller believe that access is (relatively) cheap.
fa: نکته ۲: از ویژگی‌های کلاس برای اجرای عملیات سنگین محاسباتی استفاده نکنید. مشخصه باعث می شود که تابع صدا زننده گمان کند که دسترسی (نسبتا) کم‌هزینه است.

source: If your class is intended to be subclassed, and you have attributes that you do not want subclasses to use, consider naming them with double leading underscores and no trailing underscores. This invokes Python's name mangling algorithm, where the name of the class is mangled into the attribute name. This helps avoid attribute name collisions should subclasses inadvertently contain attributes with the same name.
fa: اگر قرار است از کلاس شما ارث‌بری شود، و مشخصه‌هایی دارد که نمی‌خواهید زیرکلاس‌ها از آن‌ها استفاده کنند، آن‌ها را با دو زیرخط‌ آغازین و بدون زیرخط پایانی نام‌گذاری کنید. این کار الگوریتم دستکاری نام‌ها در پایتون را فراخوانی می‌کند، که نام کلاس را با نام مشخصه کلاس پیوند می‌زند. این کمک می کند تا اگر زیرکلاس‌ها به طور ناخواسته دارای مشخصه‌هایی با همان نام باشند، از تداخل نام مشخصه‌ها جلوگیری شود.

source: Note 1: Note that only the simple class name is used in the mangled name, so if a subclass chooses both the same class name and attribute name, you can still get name collisions.
fa: نکته ۱: توجه داشته باشید که فقط نام کلاس با نام مشخصه کلاس پیوند می‌خورد، بنابراین اگر نام یک زیرکلاس و مشخصه آن با نام کلاس و مشخصه بالادستی یکی باشد، همچنان دچار تداخل نام میشوید.

source: Note 2: Name mangling can make certain uses, such as debugging and ``__getattr__()``, less convenient. However the name mangling algorithm is well documented and easy to perform manually.
fa: نکته ۲: دستکاری نام می‌تواند کاربردهای خاصی مانند اشکال‌زدایی و ``__getattr__()`` را سخت‌تر کند. با این حال، الگوریتم دستکاری نام به خوبی مستند شده است و به راحتی به صورت دستی انجام می‌شود.

source: Note 3: Not everyone likes name mangling. Try to balance the need to avoid accidental name clashes with potential use by advanced callers.
fa: نکته ۳: همه از دستکاری نام خوششان نمی‌آید. سعی کنید تعادل بین «نیاز به جلوگیری از تصادم نام» و «استفاده احتمالی توسط صدازننده‌های پیشرفته» را برقرار کنید.

source: Public and Internal Interfaces
fa: رابط‌های عمومی و داخلی

source: Any backwards compatibility guarantees apply only to public interfaces. Accordingly, it is important that users be able to clearly distinguish between public and internal interfaces.
fa: هرگونه ضمانت سازگاری با نسخه‌های پیشین فقط برای اینترفیس‌های عمومی اعمال می‌شود. بر این اساس، مهم است که کاربران بتوانند به وضوح بین اینترفیس‌های عمومی و داخلی تمایز قائل شوند.

source: Documented interfaces are considered public, unless the documentation explicitly declares them to be provisional or internal interfaces exempt from the usual backwards compatibility guarantees. All undocumented interfaces should be assumed to be internal.
fa: اینترفیس‌های مستند شده، عمومی درنظر گرفته می‌شوند، مگر اینکه اسناد به صراحت آنها را موقت یا اینترفیس‌های داخلی اعلام کند که از ضمانت‌های سازگاری با نسخه‌های پیشین معمول، مستثنی هستند. همه اینترفیس‌های غیرمستند باید داخلی فرض شوند.

source: To better support introspection, modules should explicitly declare the names in their public API using the ``__all__`` attribute. Setting ``__all__`` to an empty list indicates that the module has no public API.
fa: برای پشتیبانی بهتر از رابط‌های داخلی، ماژول‌ها باید به صراحت نام‌ها را در API عمومی خود با استفاده از مشخصه ``__all__`` تعریف کنند. تنظیم ``__all__`` به یک لیست خالی نشان می‌دهد که ماژول فاقد API عمومی است.

source: Even with ``__all__`` set appropriately, internal interfaces (packages, modules, classes, functions, attributes or other names) should still be prefixed with a single leading underscore.
fa: حتی با تنظیم ``__all__`` بصورت صحیح، واسط‌های داخلی (بسته‌ها، ماژول‌ها، کلاس‌ها، توابع، مشخصه‌ها و بقیه نام‌ها) هنوز باید همراه با یک زیرخط به صورت پیشوند باشند.

source: An interface is also considered internal if any containing namespace (package, module or class) is considered internal.
fa: اگر فضانام (بسته، ماژول یا کلاس) دربرگیرندهٔ یک اینترفیس، داخلی در نظر گرفته شود، آن اینترفیس نیز داخلی در نظر گرفته خواهد شد.

source: Imported names should always be considered an implementation detail. Other modules must not rely on indirect access to such imported names unless they are an explicitly documented part of the containing module's API, such as ``os.path`` or a package's ``__init__`` module that exposes functionality from submodules.
fa: نام‌های ایمپورت‌شده همیشه باید به عنوان جزییات پیاده‌سازی در نظر گرفته شوند. ماژول‌های دیگر نباید به دسترسی غیرمستقیم به این نام‌های ایمپورت‌شده متکی باشند، مگر اینکه بخش به صراحت مستند‌شده از API ماژول باشند، مانند ``os.path`` یا ماژول ``__init__`` در بسته‌ها، که عملکرد زیرماژول‌ها را نشان می‌دهد.

source: Programming Recommendations
fa: پیشنهادات برنامه‌نویسی

source: Code should be written in a way that does not disadvantage other implementations of Python (PyPy, Jython, IronPython, Cython, Psyco, and such).
fa: کد باید به گونه‌ای نوشته شود که با دیگر پیاده‌سازی‌های پایتون (PyPy, Jython, IronPython, Cython, Psyco, و غیره) ناسازگار نباشد.

source: For example, do not rely on CPython's efficient implementation of in-place string concatenation for statements in the form ``a += b`` or ``a = a + b``. This optimization is fragile even in CPython (it only works for some types) and isn't present at all in implementations that don't use refcounting. In performance sensitive parts of the library, the ``''.join()`` form should be used instead. This will ensure that concatenation occurs in linear time across various implementations.
fa: برای مثال، به پیاده سازی چسباندن درجای رشته‌ها در CPython برای عباراتی به شکل ``a += b`` یا ``a = a + b`` تکیه نکنید. این بهینه‌سازی حتی در CPython هم شکننده است (فقط برای برخی از انواع داده‌ها کار می‌کند) و در پیاده‌سازی‌هایی که از شمارش ارجاع (refcounting یا Reference counting) استفاده نمی‌کنند اصلا وجود ندارد. در بخش‌های حساس به عملکرد کتابخانه، باید به جای آن از فرم ``.join()`` استفاده شود. این اطمینان حاصل می‌کند که چسباندن در بین پیاده‌سازی‌های مختلف با پیچیدگی زمانی خطی رخ می دهد.

source: Comparisons to singletons like None should always be done with ``is`` or ``is not``, never the equality operators.
fa: در هنگام بررسی یک متغیر با موارد تک‌نوعی در پایتون مانند None باید از عبارات ``is`` یا ``is not`` بجای عملگر مساوی استفاده کنید.

source: Also, beware of writing ``if x`` when you really mean ``if x is not None`` -- e.g. when testing whether a variable or argument that defaults to None was set to some other value. The other value might have a type (such as a container) that could be false in a boolean context!
fa: همچنین هنگام نوشتن ``if x`` در حالی که واقعاً منظورتان ``if x is not None`` است، مراقب باشید -- برای نمونه، هنگام آزمایش اینکه آیا متغیر یا آرگومانی که به صورت پیش‌فرض مقدارش None است، مقدار دیگری دارد یا خیر. مقدار دیگر ممکن است یک نوع داده (مانند یک نوع داده کانتینری) داشته باشد که در یک شرایط بولی ممکن است مقدارش False باشد!

source: Use ``is not`` operator rather than ``not ... is``. While both expressions are functionally identical, the former is more readable and preferred::
fa: از عملگر ``is not`` به جای ``not ... is`` استفاده کنید. درحالی که هردو عملکرد مشابهی دارند، فرم اول خوانایی بیشتری نسبت به فرم دوم دارد و ترجیح داده میشود::

source: When implementing ordering operations with rich comparisons, it is best to implement all six operations (``__eq__``, ``__ne__``, ``__lt__``, ``__le__``, ``__gt__``, ``__ge__``) rather than relying on other code to only exercise a particular comparison.
fa: هنگام پیاده‌سازی عملکردهای اولویت‌دار با مقایسه‌های زیاد، بهتر است هر شش عملکرد (``__eq__``, ``__ne__``,``__lt__``, ``__le__``,``__gt__``, ``__ge__ ``) را پیاده‌سازی کنید به جای اینکه به کدی دیگر فقط برای انجام یک مقایسه خاص تکیه کنید.

source: To minimize the effort involved, the ``functools.total_ordering()`` decorator provides a tool to generate missing comparison methods.
fa: برای به حداقل رساندن پیچیدگی، دکوراتور ``functools.total_ordering()`` ابزاری است برای ساختن متدهای مقایسهٔ گم شده.

source: :pep:`207` indicates that reflexivity rules *are* assumed by Python. Thus, the interpreter may swap ``y > x`` with ``x < y``, ``y >= x`` with ``x <= y``, and may swap the arguments of ``x == y`` and ``x != y``. The ``sort()`` and ``min()`` operations are guaranteed to use the ``<`` operator and the ``max()`` function uses the ``>`` operator. However, it is best to implement all six operations so that confusion doesn't arise in other contexts.
fa: پپ ۲۰۷ نشان می‌دهد که قوانین بازتاب توسط پایتون در نظر گرفته شده است. بنابراین، مفسر ممکن است ``y > x`` را با ``y >= x``، ``x < y`` را با ``x <= y``، و ممکن است آرگومان های ``x == y`` و ``x != y`` را تعویض کند. عملکرد توابع `` sort()`` و ``min()`` برای استفاده از عملگر ``<`` تضمین شده و تابع ``max()`` از عملگر ``>`` استفاده می کند. با این حال، بهتر است هر شش عملکرد را پیاده‌سازی کنید تا سردرگمی در زمینه‌های دیگر ایجاد نشود.

source: Always use a def statement instead of an assignment statement that binds a lambda expression directly to an identifier::
fa: همیشه به جای تخصیص مستقیم عبارت لامبدا به یک شناسه، از یک دستور def استفاده کنید::

source: The first form means that the name of the resulting function object is specifically 'f' instead of the generic '<lambda>'. This is more useful for tracebacks and string representations in general. The use of the assignment statement eliminates the sole benefit a lambda expression can offer over an explicit def statement (i.e. that it can be embedded inside a larger expression)
fa: شکل اول به این معنی است که نام شی تابع به‌دست‌آمده به‌جای کلمه '<lambda>' به طور خاص ``f`` است. به طور کلی این کار در ردیابی‌ها و نمایش رشته‌ها مفیدتر است. استفاده از دستور انتساب، تنها مزیتی را که یک عبارت لامبدا می‌تواند نسبت به یک عبارت def صریح ارائه دهد، حذف می‌کند (یعنی اینکه می‌توان آن را در یک عبارت بزرگ‌تر جا کرد)

source: Derive exceptions from ``Exception`` rather than ``BaseException``. Direct inheritance from ``BaseException`` is reserved for exceptions where catching them is almost always the wrong thing to do.
fa: استثناها را به جای ``BaseException`` از ``Exception`` ارث‌بری کنید. ارث‌بری مستقیم از ``BaseException`` برای استثناهایی است که رخ دادن و گرفتن آن‌ها، تقریباً همیشه کار اشتباهی است.

source: Design exception hierarchies based on the distinctions that code *catching* the exceptions is likely to need, rather than the locations where the exceptions are raised. Aim to answer the question "What went wrong?" programmatically, rather than only stating that "A problem occurred" (see :pep:`3151` for an example of this lesson being learned for the builtin exception hierarchy)
fa: سلسله مراتب استثناها را بر اساس تمایزاتی طراحی کنید که *رخ دادن* آن‌ها در کد احتمالاً لازم باشد، نه مکان‌هایی که استثناها در آنجا رخ می‌دهند. هدف پاسخ برنامه‌ریزی شده به سوال \"چه اشتباهی رخ داد؟\" است، به جای اینکه فقط بیان کند که \"یک مشکل رخ داده است\". (برای مثالی از این نکته که برای سلسله مراتب استثناء داخلی گفته شد، پپ ۳۱۵۱ را ببینید)

source: Class naming conventions apply here, although you should add the suffix "Error" to your exception classes if the exception is an error. Non-error exceptions that are used for non-local flow control or other forms of signaling need no special suffix.
fa: قراردادهای نامگذاری کلاس در اینجا اعمال می‌شود، اگرچه اگر استثنا یک خطا باشد، باید پسوند "Error" را به کلاس‌های استثنای خود اضافه کنید. استثناهایی که نوع آن‌ها خطا نیست و برای کنترل جریان غیرمحلی یا سایر اشکال سیگنال‌دهی استفاده می‌شوند، نیازی به پسوند خاصی ندارند.

source: Use exception chaining appropriately. ``raise X from Y`` should be used to indicate explicit replacement without losing the original traceback.
fa: از زنجیره‌ای کردن استثناها به درستی استفاده کنید. «رخ دادن استثناء X به دلیل استثناء Y» باید برای نشان دادن جایگزینی صریح، بدون از دست دادن ردیابی رخداد اصلی استفاده شود.

source: When deliberately replacing an inner exception (using ``raise X from None``), ensure that relevant details are transferred to the new exception (such as preserving the attribute name when converting KeyError to AttributeError, or embedding the text of the original exception in the new exception message).
fa: هنگام جایگزینی عمدی یک استثناء داخلی (با استفاده از فرم "رخ دادن استثناء X از None")، اطمینان حاصل کنید که جزئیات مربوطه، به استثناء جدید منتقل شده است (مانند حفظ نام مشخصه هنگام تبدیل استثناء KeyError به استثناء AttributeError، یا قرار دادن متن استثناء اصلی در پیام استثناء جدید).

source: When catching exceptions, mention specific exceptions whenever possible instead of using a bare ``except:`` clause::
fa: هنگام گرفتن استثناها، به جای استفاده از عبارت ساده ``except:``، هر زمان که ممکن است، استثناهای مشخصی را ذکر کنید::

source: A bare ``except:`` clause will catch SystemExit and KeyboardInterrupt exceptions, making it harder to interrupt a program with Control-C, and can disguise other problems. If you want to catch all exceptions that signal program errors, use ``except Exception:`` (bare except is equivalent to ``except BaseException:``).
fa: یک عبارت ساده ``except:`` استثناهای SystemExit و KeyboardInterrupt را می‌گیرد و بستن برنامه با کلیدهای ترکیبی Control-C را دشوارتر می‌کند و می‌تواند مشکلات دیگر را پنهان کند. اگر می‌خواهید همه استثناهایی را که به خطاهای برنامه سیگنال می‌دهند، بیابید، از ``except Exception:`` استفاده کنید (except ساده معادل ``except BaseException:`` است).

source: A good rule of thumb is to limit use of bare 'except' clauses to two cases:
fa: یک قانون سرانگشتی خوب این است که استفاده از عبارت‌های ساده 'except' را به دو مورد محدود کنید:

source: If the exception handler will be printing out or logging the traceback; at least the user will be aware that an error has occurred.
fa: اگر کنترل‌کننده استثنا در حال چاپ کردن یا لاگ کردن ردیابی رخدادها باشد. حداقل کاربر متوجه خواهد شد که یک خطا رخ داده است.

source: If the code needs to do some cleanup work, but then lets the exception propagate upwards with ``raise``. ``try...finally`` can be a better way to handle this case.
fa: اگر کد نیاز به بازنویسی و تمیزکاری دارد، اما اجازه می‌دهد تا استثنا با عبارت ``raise`` بهتر شود. ساختار ``try...finally`` می‌تواند راه بهتری برای بکار بردن این مورد باشد.

source: When catching operating system errors, prefer the explicit exception hierarchy introduced in Python 3.3 over introspection of ``errno`` values.
fa: هنگام گرفتن خطاهای سیستم عامل، سلسله مراتب استثناء واضح معرفی شده در پایتون ۳.۳ را به تشخیص نوع مقادیر ``errno`` ترجیح دهید.

source: Additionally, for all try/except clauses, limit the ``try`` clause to the absolute minimum amount of code necessary. Again, this avoids masking bugs::
fa: علاوه بر این، برای تمام عبارات try/except در بند ``try`` سعی کنید کمترین میزان کد را بنویسید. این کار از پوشاندن سایر اشکالات در برنامه جلوگیری می‌کند::

source: When a resource is local to a particular section of code, use a ``with`` statement to ensure it is cleaned up promptly and reliably after use. A try/finally statement is also acceptable.
fa: وقتی منبعی متعلق به بخش خاصی از کد است، از عبارت ``with`` استفاده کنید تا مطمئن شوید که پس از استفاده، به سرعت و با اطمینان پاکسازی می‌شود. عبارت try/finally نیز قابل قبول است.

source: Context managers should be invoked through separate functions or methods whenever they do something other than acquire and release resources::
fa: مدیران زمینه (Context managers) باید از طریق توابع یا متدهای جداگانه، هر زمان که کاری غیر از گرفتن و آزادسازی منابع انجام می‌دهند، فراخوانی شوند::

source: The latter example doesn't provide any information to indicate that the ``__enter__`` and ``__exit__`` methods are doing something other than closing the connection after a transaction. Being explicit is important in this case.
fa: مثال دوم هیچ اطلاعاتی ارائه نمی‌دهد که نشان دهد متدهای ``__enter__`` و ``__exit__`` کاری غیر از بستن اتصال پس از تراکنش انجام می‌دهند. صریح بودن در این مورد مهم است.

source: Be consistent in return statements. Either all return statements in a function should return an expression, or none of them should. If any return statement returns an expression, any return statements where no value is returned should explicitly state this as ``return None``, and an explicit return statement should be present at the end of the function (if reachable)::
fa: درمورد دستورات return ثابت قدم باشید. یا تمام دستورات return در یک تابع باید یک عبارت را برگردانند یا هیچ کدام نباید. اگر هر دستور return یک عبارت را برمی‌گرداند، هر دستور return که در آن هیچ مقداری برگردانده نشده است باید به صراحت آن را به عنوان ``return None`` بیان کند، و یک دستور return صریح باید در انتهای تابع وجود داشته باشد (اگر قابل دسترسی باشد)::

source: Use ``''.startswith()`` and ``''.endswith()`` instead of string slicing to check for prefixes or suffixes.
fa: به منظور بررسی وجود پیشوند یا پسوند در یک رشته، بجای برش آن رشته، از متدهای ``''.startswith()`` و ``''.endswith()`` استفاده کنید.

source: startswith() and endswith() are cleaner and less error prone::
fa: متدهای ``startswith()`` و ``endswith()`` تمیزتر و کم‌خطاتر هستند::

source: Object type comparisons should always use isinstance() instead of comparing types directly::
fa: در هنگام مقایسه‌ی اشیاء بجای مقایسهٔ نوع آن‌ها به صورت مستقیم، همیشه از متد ``isinstance()`` استفاده کنید::
