Repository: hanifbirgani/pep8ir
Catalog: locale/*/LC_MESSAGES/index.po
Languages: fa

source: Immediately before a comma, semicolon, or colon::
fa: قبل از ویرگول، نقطه‌ویرگول یا دونقطه::

source: However, in a slice the colon acts like a binary operator, and should have equal amounts on either side (treating it as the operator with the lowest priority). In an extended slice, both colons must have the same amount of spacing applied. Exception: when a slice parameter is omitted, the space is omitted::
fa: با این حال در برش لیست با یک عملگر دونقطه، دونقطه مانند یک عملگر باینری عمل می‌کند و باید در هر طرف آن به یک اندازه فضا وجود داشته باشد (آن را عملگری با کمترین اولویت در نظر بگیرید). در برش لیست با دو عملگر دونقطه، هر دو عملگر باید فاصله یکسانی داشته باشند. استثنا: وقتی یک پارامتر در برش لیست حذف می‌شود، فاصله بین آن و عملگر دونقطه هم حذف می‌شود::

source: Immediately before the open parenthesis that starts the argument list of a function call::
fa: قبل از باز کردن پرانتز در فراخوانی تابع::

source: Immediately before the open parenthesis that starts an indexing or slicing::
fa: قبل از باز کردن براکت مربوط به ایندکس لیست و دیکشنری::

source: More than one space around an assignment (or other) operator to align it with another::
fa: بیش از یک فاصله اطراف عملگر تخصیص ``=`` برای تراز کردن کلمات با دیگر خطوط::

source: Other Recommendations
fa: دیگر پیشنهادها

source: Avoid trailing whitespace anywhere. Because it's usually invisible, it can be confusing: e.g. a backslash followed by a space and a newline does not count as a line continuation marker. Some editors don't preserve it and many projects (like CPython itself) have pre-commit hooks that reject it.
fa: از گذاشتن فاصله در انتهای خطوط خودداری کنید. زیرا در بیشتر زمان‌ها این فاصله نامرئی است و می‌تواند باعث پیچیدگی شود: برای نمونه یک فاصله بعد از بک‌اسلش در انتهای خط، به عنوان علامت یک خط ادامه‌دار شناسایی نمی‌شود. برخی ویرایشگرهای کد از این کار پیشگیری می‌کنند و بسیاری از پروژه‌ها (مانند خود CPython) به صورت خودکار کاراکتر فاصله در انتهای خطوط را شناسایی و رد می‌کند.

source: Always surround these binary operators with a single space on either side: assignment (``=``), augmented assignment (``+=``, ``-=`` etc.), comparisons (``==``, ``<``, ``>``, ``!=``, ``<>``, ``<=``, ``>=``, ``in``, ``not in``, ``is``, ``is not``), Booleans (``and``, ``or``, ``not``).
fa: همیشه قبل و بعد از این عملگرها یک فاصله قرار دهید: مساوی/تخصیص (``=``)، تخصیص غنی‌شده (مانند ``+=``، ``-=`` و غیره)، مقایسه‌ها (``==``, ``<``, ``>``, ``!=``, ``<>``, ``<=``, ``>=``, ``in``, ``not in``, ``is``, ``is not``)، عملگرهای بولی منطقی (``and``, ``or``, ``not``).

source: If operators with different priorities are used, consider adding whitespace around the operators with the lowest priority(ies). Use your own judgment; however, never use more than one space, and always have the same amount of whitespace on both sides of a binary operator::
fa: در صورتی که در یک خط از عملگرهایی با اولویت‌های مختلف استفاده می‌کنید، در چپ و راست عملگر با اولویت کمتر فاصله قرار دهید. به هیچ وجه از بیش از یک فاصله استفاده نکنید و همیشه به همان اندازه در هر دو طرف یک عملگر باینری فضای خالی داشته باشید::

source: Function annotations should use the normal rules for colons and always have spaces around the ``->`` arrow if present. (See `Function Annotations`_ below for more about function annotations.)::
fa: انوتیشن‌های توابع باید از قوانین عادی برای دونقطه استفاده کنند و در صورت وجود نشانه پیکان ``->`` همیشه فضای خالی اطراف آن باشد. (برای اطلاعات بیشتر به `انوتیشن‌های توابع`_ مراجعه کنید.)::

source: Don't use spaces around the ``=`` sign when used to indicate a keyword argument, or when used to indicate a default value for an *unannotated* function parameter::
fa: به هنگام نشان دادن یک آرگومان، یا نشان دادن مقدار پیش‌فرض پارامتر یک تابع *unannotated* از فضای خالی اطراف علامت ``=`` استفاده نکنید::

source: When combining an argument annotation with a default value, however, do use spaces around the ``=`` sign::
fa: با این حال، هنگام تخصیص مقدار پیش‌فرض به یک انوتیشن، از فضای خالی اطراف علامت ``=`` استفاده کنید::

source: Compound statements (multiple statements on the same line) are generally discouraged::
fa: نباید از چندین عبارت دستوری در یک خط استفاده کرد::

source: Rather not::
fa: نامناسب::

source: While sometimes it's okay to put an if/for/while with a small body on the same line, never do this for multi-clause statements. Also avoid folding such long lines!
fa: هرچند گاهی اوقات قرار دادن دستورات تکی if یا for یا while در یک خط مجاز است، اما هیچگاه این کار را برای دستورات چند جمله‌ای انجام ندهید. همچنین از تا کردن این خطوط طولانی نیز خودداری کنید!

source: Definitely not::
fa: قطعاً نه::

source: When to Use Trailing Commas
fa: زمان استفاده از ویرگول انتهایی

source: Trailing commas are usually optional, except they are mandatory when making a tuple of one element. For clarity, it is recommended to surround the latter in (technically redundant) parentheses::
fa: ویرگول‌های انتهایی معمولا اختیاری هستند، با این تفاوت که هنگام ساختن یک تاپل تک عنصری اجباری هستند. در این صورت برای تمیزی کد، توصیه می‌شود آن را در پرانتزهای (از نظر فنی زائد) قرار دهید::

source: When trailing commas are redundant, they are often helpful when a version control system is used, when a list of values, arguments or imported items is expected to be extended over time. The pattern is to put each value (etc.) on a line by itself, always adding a trailing comma, and add the close parenthesis/bracket/brace on the next line. However it does not make sense to have a trailing comma on the same line as the closing delimiter (except in the above case of singleton tuples)::
fa: استفاده از ویرگول انتهایی اضافه، برای زمانی که از یک سیستم کنترل نسخه استفاده می‌شود یا زمانی که انتظار می‌رود لیستی از مقادیر، آرگومان‌ها یا آیتم‌های ایمپورت شده در طول زمان زیاد شوند، اغلب مفید است. الگوی استفاده از آن به این صورت است که هر کدام از مقادیر (و غیره) را در هر خط نوشته و به انتهای آن ویرگول انتهایی را اضافه می‌کنیم و پرانتز، کروشه یا آکولاد بسته را در خط بعدی می‌نویسیم. با این حال، استفاده از ویرگول انتهایی به همراه پرانتز، کروشه یا آکولاد بسته در یک خط بی‌معنی است (به غیر از تاپل تک عضوی مورد بالا)::

source: Comments
fa: کامنت‌ها

source: Comments that contradict the code are worse than no comments. Always make a priority of keeping the comments up-to-date when the code changes!
fa: کامنت‌هایی که با کد در تناقض هستند بدتر از کامنت‌هایی هستند که هرگز نوشته نشدند. همیشه کامنت‌ها را همگام با تغییرات کدها به‌روز نگه دارید!

source: Comments should be complete sentences. The first word should be capitalized, unless it is an identifier that begins with a lower case letter (never alter the case of identifiers!).
fa: کامنت‌ها باید جملات کامل باشند. کلمهٔ اول باید با حروف بزرگ آغاز شود، مگر اینکه کلمهٔ اول به یک شناسه (نام یک متغیر، تابع، ماژول و...) اشاره کرده باشد که با حروف کوچک آغاز شود.

source: Block comments generally consist of one or more paragraphs built out of complete sentences, with each sentence ending in a period.
fa: کامنت‌های بلوکی معمولا شامل یک پاراگراف یا بیشتر هستند. پاراگراف‌ها باید از جملات کامل تشکیل شده باشند و هر جمله باید با علامت نقطه به پایان رسیده باشد.

source: You should use two spaces after a sentence-ending period in multi- sentence comments, except after the final sentence.
fa: در کامنت‌های چندجمله‌ای، شما باید پس از نقطهٔ آخر هر جمله از دو فاصله استفاده کنید؛ به استثنای آخرین جمله.

source: Ensure that your comments are clear and easily understandable to other speakers of the language you are writing in.
fa: اطمینان حاصل کنید که کامنت‌های شما واضح و به آسانی قابل فهم هستند.

source: Python coders from non-English speaking countries: please write your comments in English, unless you are 120% sure that the code will never be read by people who don't speak your language.
fa: برنامه‌نویسانِ پایتون غیرانگلیسی‌زبان: لطفاً کامنت‌های خود را به زبان انگلیسی بنویسید، مگر اینکه ۱۲۰٪ مطمئن باشید که کدهای شما را هرگز هیچ برنامه‌نویس غیرهمزبان شما نخواهد خواند.

source: Block Comments
fa: کامنت‌های بلوکی

source: Block comments generally apply to some (or all) code that follows them, and are indented to the same level as that code. Each line of a block comment starts with a ``#`` and a single space (unless it is indented text inside the comment).
fa: کامنت‌های بلوکی معمولا به کدهایی که بعد از آن‌ها نوشته می‌شود اشاره دارند. تورفتگی این کامنت‌ها باید به اندازه تورفتگی کدهای مربوطه باشد. هر خط از کامنت‌های بلوکی باید با علامت ``#`` و یک فاصله پس از آن آغاز شود (به جز در مواردی که درون بلوک کامنت‌ها هم نیاز به تورفتگی وجود داشته باشد).

source: Paragraphs inside a block comment are separated by a line containing a single ``#``.
fa: پاراگراف‌های درون یک بلوک کامنت، توسط خطی که با یک علامت ``#`` شروع می‌شود از هم جدا می‌شوند.

source: Inline Comments
fa: کامنت‌های درون‌خطی

source: Use inline comments sparingly.
fa: تا حد امکان از کامنت‌های درون‌خطی استفاده نکنید.

source: An inline comment is a comment on the same line as a statement. Inline comments should be separated by at least two spaces from the statement. They should start with a # and a single space.
fa: کامنت درون‌خطی در واقع کامنتی است که در همان خط کد نوشته می‌شود. کامنت‌های درون‌خطی باید حداقل با دو فاصله از کد نوشته شوند. آن‌ها باید با یک علامت # و یک فاصله بعد از آن آغاز شوند.

source: Inline comments are unnecessary and in fact distracting if they state the obvious. Don't do this::
fa: کامنت‌های درون‌خطی در صورتی که توضیح واضحات باشند، کاملا غیرضروری و مزاحم هستند. این کار را انجام ندهید::

source: But sometimes, this is useful::
fa: اما گاهی وقت‌ها می‌تواند مفید باشد::

source: Documentation Strings
fa: رشته‌های مستندات

source: Conventions for writing good documentation strings (a.k.a. "docstrings") are immortalized in :pep:`257`.
fa: اصول کامل برای نوشتن مستندات خوب در پپ ۲۵۷ شرح داده شده‌اند.

source: Write docstrings for all public modules, functions, classes, and methods. Docstrings are not necessary for non-public methods, but you should have a comment that describes what the method does. This comment should appear after the ``def`` line.
fa: برای تمام ماژول‌ها، توابع، کلاس‌ها و متدهای خود که به صورت عمومی تعریف کرده‌اید مستندات مربوط به آن‌ها را بنویسید. نوشتن این مستندات برای سایر متدهایی که به صورت عمومی تعریف نشده‌اند الزامی نیست؛ اما باید برای این متدها نیز یک کامنت بنویسید تا عمکلرد آن را شرح دهد. این کامنت باید در پایین خط ``def`` (اولین خط درون متد شما) نوشته شود.

source: :pep:`257` describes good docstring conventions. Note that most importantly, the ``"""`` that ends a multiline docstring should be on a line by itself::
fa: پپ ۲۵۷ اصول مستندنویسی را به خوبی توضیح می‌دهد. نکته مهم این است که عبارت ``\"\"\"`` که برای پایان دادن به مستندات استفاده می‌شود باید در یک خط جداگانه قرار گیرد.

source: For one liner docstrings, please keep the closing ``"""`` on the same line::
fa: برای مستندات یک خطی، لطفاً ``"""`` پایانی را در همان خط قرار دهید::

source: Naming Conventions
fa: اصول نامگذاری

source: The naming conventions of Python's library are a bit of a mess, so we'll never get this completely consistent -- nevertheless, here are the currently recommended naming standards. New modules and packages (including third party frameworks) should be written to these standards, but where an existing library has a different style, internal consistency is preferred.
fa: اصول نامگذاری در کتابخانه اصلی پایتون کمی شلوغ و نامنظم است، به همین دلیل در این زمینه هیچگاه به یکدست بودن ایده‌آل نخواهیم رسید. ماژول‌ها و کدهای جدید پایتون باید با رعایت نکات زیر نوشته شوند، هرچند اگر در کتابخانه‌ای از اصول دیگری پیروی شده بود، حفظ یکدست بودن داخلی کدها، بر اصول پیشنهادی این شیوه‌نامه اولویت دارد. استانداردهای کنونی و پیشنهادی برای نامگذاری در پایتون به شرح زیر است.

source: Overriding Principle
fa: اصل مهم

source: Names that are visible to the user as public parts of the API should follow conventions that reflect usage rather than implementation.
fa: نام‌هایی که به عنوان بخشی از یک API عمومی به کاربران نمایش داده می‌شوند، بهتر است با توجه به نوع کارکرد آن بخش از API انتخاب شوند.

source: Descriptive: Naming Styles
fa: توصیفی: سبک‌های نام‌گذاری

source: There are a lot of different naming styles. It helps to be able to recognize what naming style is being used, independently from what they are used for.
fa: سبک‌های نامگذاری مختلف زیادی وجود دارند و مستقل از آنچه که برای آن استفاده می‌شوند، کمک می‌کنند که بتوانیم تشخیص دهیم از چه سبک نامگذاری استفاده می‌شود.

source: The following naming styles are commonly distinguished:
fa: شیوه‌های نامگذاری زیر به راحتی قابل تفکیک و تشخیص هستند:

source: ``b`` (single lowercase letter)
fa: ``b`` (تک حرف کوچک)

source: ``B`` (single uppercase letter)
fa: ``B`` (تک حرف بزرگ)

source: ``CapitalizedWords`` (or CapWords, or CamelCase -- so named because of the bumpy look of its letters [4]_). This is also sometimes known as StudlyCaps.
fa: ``CapitalizedWords`` (یا CapWords نگارش کلمات به هم چسبیده با حرف اول بزرگ ، یا CamelCase (نگارش شتری) -- که این نام گذاری به دلیل ظاهر ناهموار حروف آن است [4]_). این نوع نگارش گاهی اوقات به عنوان StudlyCaps نیز شناخته میشود.

source: Note: When using acronyms in CapWords, capitalize all the letters of the acronym. Thus HTTPServerError is better than HttpServerError.
fa: نکته: هنگام استفاده از کلمات اختصاری در نگارش CapWords، تمام حروفِ کلمه اختصاری با حروف بزرگ نوشته می‌شود. بنابراین نوشتن HTTPServerError بهتر از HttpServerError است.

source: ``mixedCase`` (differs from CapitalizedWords by initial lowercase character!)
fa: ``mixedCase`` (تفاوت آن با نگارش CapitalizedWords این است که اولین حرف آن به صورت کوچک نوشته می شود!)

source: ``Capitalized_Words_With_Underscores`` (ugly!)
fa: ``Capitalized_Words_With_Underscores`` (زشت!)

source: There's also the style of using a short unique prefix to group related names together. This is not used much in Python, but it is mentioned for completeness. For example, the ``os.stat()`` function returns a tuple whose items traditionally have names like ``st_mode``, ``st_size``, ``st_mtime`` and so on. (This is done to emphasize the correspondence with the fields of the POSIX system call struct, which helps programmers familiar with that.)
fa: همچنین سبک استفاده از یک پیشوند منحصر به فرد کوتاه برای گروه‌بندی نام‌های مرتبط باهم وجود دارد. این سبک خیلی در پایتون استفاده نمی‌شود، اما برای کامل بودن ذکر شده است. برای مثال، تابع ``os.stat()`` یک تاپل را برمی‌گرداند که آیتم‌های آن معمولاً دارای نام‌هایی مانند ``st_mode``، ``st_size``، ``st_mtime`` و غیره هستند. (این کار برای تأکید بر مطابقت با فیلدهای ساختار سیستم کال POSIX انجام می شود که به برنامه‌نویسانی که با آن آشنا هستند کمک می کند.)

source: The X11 library uses a leading X for all its public functions. In Python, this style is generally deemed unnecessary because attribute and method names are prefixed with an object, and function names are prefixed with a module name.
fa: کتابخانه X11 از یک پیشوند X برای تمام توابع عمومی خود استفاده می‌کند. در پایتون، این سبک به طور کلی غیرضروری تلقی می‌شود زیرا پیشوند نام مشخصه‌ها و متدها، نام یک شی است و پیشوند نام توابع نیز، نام یک ماژول.

source: In addition, the following special forms using leading or trailing underscores are recognized (these can generally be combined with any case convention):
fa: علاوه بر این، فرم‌های ویژه زیر که زیرخط‌هایی در ابتدا یا انتهای خود دارند، شناخته شده هستند (این‌ فرم‌ها را معمولا می‌توان با هر کدام از شیوه‌های نامگذاری ترکیب کرد):

source: ``_single_leading_underscore``: weak "internal use" indicator. E.g. ``from M import *`` does not import objects whose names start with an underscore.
fa: ``_single_leading_underscore``: نشانهٔ ضعیف برای «استفاده داخلی». برای نمونه عبارت ``from M import *`` اشیائی که اسم آن‌ها با یک زیرخط شروع می‌شود را ایمپورت نمی‌کند.

source: ``single_trailing_underscore_``: used by convention to avoid conflicts with Python keyword, e.g. ::
fa: ``single_trailing_underscore_``: طبق قرارداد برای جلوگیری از مغایرت با کلمه‌های کلیدی پایتون استفاده می‌شود، برای نمونه::

source: ``__double_leading_underscore``: when naming a class attribute, invokes name mangling (inside class FooBar, ``__boo`` becomes ``_FooBar__boo``; see below).
fa: ``__double_leading_underscore``: هنگام نامگذاری یک مشخصه کلاس، دستکاری نام (name mangling) را فراخوانی می‌کند (در داخل کلاس FooBar، ``__boo`` تبدیل به ``_FooBar__boo`` می‌شود؛ زیر را ببینید).

source: ``__double_leading_and_trailing_underscore__``: "magic" objects or attributes that live in user-controlled namespaces. E.g. ``__init__``, ``__import__`` or ``__file__``. Never invent such names; only use them as documented.
fa: ``__double_leading_and_trailing_underscore__``: اشیاء و مشخصه‌های «جادویی» که در فضانام‌های تحت کنترل کاربر قرار دارند. برای مثال ``__init__``, ``__import__`` or ``__file__``. هرگز چنین اسم‌هایی را نسازید؛ فقط از آن‌ها طبق مستندات پایتون استفاده کنید.

source: Prescriptive: Naming Conventions
fa: تجویزی: قواعد نام‌گذاری

source: Names to Avoid
fa: نام‌های نامناسب

source: Never use the characters 'l' (lowercase letter el), 'O' (uppercase letter oh), or 'I' (uppercase letter eye) as single character variable names.
fa: هرگز از 'l' (حرف کوچک L)، 'O' (حرف بزرگ o) یا 'I' (حرف بزرگ i) برای نامگذاری متغیرهای تک‌حرفی استفاده نکنید.

source: In some fonts, these characters are indistinguishable from the numerals one and zero. When tempted to use 'l', use 'L' instead.
fa: در بعضی فونت‌ها، این حروف از یکدیگر و همچنین از اعداد یک و صفر قابل تفکیک نیستند. برای مثال، به جای استفاده از 'l'، از 'L' استفاده کنید.

source: ASCII Compatibility
fa: سازگاری اَسکی

source: Identifiers used in the standard library must be ASCII compatible as described in the :pep:`policy section <3131#policy-specification>` of :pep:`3131`.
fa: شناسه‌های استفاده شده در کتابخانه استاندارد باید طبق تعریف `بخش سیاستگذاری <https://www.python.org/dev/peps/pep-3131/#policy-specification>`_ پپ ۳۱۳۱ با اسکی سازگار باشند.

source: Package and Module Names
fa: نام ماژول‌ها و بسته‌ها

source: Modules should have short, all-lowercase names. Underscores can be used in the module name if it improves readability. Python packages should also have short, all-lowercase names, although the use of underscores is discouraged.
fa: ماژول‌ها باید نام‌هایی کوتاه با حروف کوچک داشته باشند. اگر استفاده از زیرخط در نام ماژول می‌تواند خوانایی را بالاتر ببرد، استفاده از آن مانعی ندارد. بسته‌های پایتون هم باید نام‌هایی کوتاه با حروف کوچک داشته باشند و استفاده از زیرخط در نامگذاری بسته‌ها پیشنهاد نمی‌شود.

source: When an extension module written in C or C++ has an accompanying Python module that provides a higher level (e.g. more object oriented) interface, the C/C++ module has a leading underscore (e.g. ``_socket``).
fa: وقتی یک ماژول با زبان C یا ++C نوشته شده و یک ماژول هم‌نام با آن در محیط پایتون وجود دارد، به گونه‌ای که ماژول پایتونی، خدمات سطح بالاتر را ارائه می‌دهد، ماژول نوشته شده با ++C/C باید با یک زیرخط شروع شود (برای مثال ``_socket``).

source: Class Names
fa: نام کلاس‌ها

source: Class names should normally use the CapWords convention.
fa: نامگذاری کلاس‌ها باید مطابق با قواعد CapWords باشد. یعنی حرف اول هر کلمه با حروف بزرگ نوشته شود و بین کلمات مختلف هیچگونه فاصله، خط و زیرخط قرار نگیرد.

source: The naming convention for functions may be used instead in cases where the interface is documented and used primarily as a callable.
fa: قواعد نامگذاری توابع ممکن است در مواردی نیز استفاده شود که یک اینترفیس، به عنوان یک شی قابل فراخوانی مستندسازی و استفاده شده باشد.

source: Note that there is a separate convention for builtin names: most builtin names are single words (or two words run together), with the CapWords convention used only for exception names and builtin constants.
fa: توجه داشته باشید که برای نام‌های داخلی یک قاعده جداگانه وجود دارد: اکثر نام‌های داخلی تک کلمه‌ای (یا دو کلمه به هم چسبیده) با قاعده نگارشی CapWords هستند که فقط برای نام‌های استثنا و ثابت‌های داخلی استفاده می‌شود.

source: Type Variable Names
fa: نام متغیر‌های گونه (تایپ)

source: Names of type variables introduced in :pep:`484` should normally use CapWords preferring short names: ``T``, ``AnyStr``, ``Num``. It is recommended to add suffixes ``_co`` or ``_contra`` to the variables used to declare covariant or contravariant behavior correspondingly::
fa: نام گونه‌های متغیرهای معرفی شده در پپ ۴۸۴ معمولاً باید از قاعدهٔ نگارشی CapWords استفاده کند که نام‌های کوتاه را ترجیح می‌دهد: ``T``, ``AnyStr``, ``Num``. توصیه می شود که پسوندهای ``_co`` یا ``_contra`` را به ترتیب به متغیرهای مورد استفاده برای تعریف رفتار هم‌وردایی یا پادوردایی اضافه کنید::

source: Exception Names
fa: نام استثناها

source: Because exceptions should be classes, the class naming convention applies here. However, you should use the suffix "Error" on your exception names (if the exception actually is an error).
fa: از آنجا که استثناها باید کلاس باشند، اصول نامگذاری کلاس‌ها نیز باید روی آن‌ها اعمال شود. با این حال، شما باید از پسوند "Error" برای استثناهایی که تعریف می‌کنید، استفاده کنید (اگر استثناء شما واقعا یک خطا است).

source: Global Variable Names
fa: نام متغیرهای عمومی

source: (Let's hope that these variables are meant for use inside one module only.) The conventions are about the same as those for functions.
fa: قواعد تقریباً همان مواردی است که برای توابع اعمال می‌شود. ( البته این متغیرها باید برای استفاده در یک ماژول در نظر گرفته شده باشند)

source: Modules that are designed for use via ``from M import *`` should use the ``__all__`` mechanism to prevent exporting globals, or use the older convention of prefixing such globals with an underscore (which you might want to do to indicate these globals are "module non-public").
fa: ماژول‌هایی که برای استفاده از طریق ``from M import *`` طراحی شده‌اند، باید از مکانیسم ``__all__`` برای جلوگیری از نشان دادن متغیرهای عمومی، یا از قرارداد قدیمی‌تر قرار دادن زیرخط در اول این متغیرهای عمومی استفاده کنند. (که ممکن است بخواهید این کار را بکنید تا نشان دهید این متغیرهای عمومی "ماژول غیرعمومی" هستند).

source: Function and Variable Names
fa: نام توابع و متغیرها

source: Function names should be lowercase, with words separated by underscores as necessary to improve readability.
fa: نام تابع باید از حروف کوچک تشکیل شده باشد و برای بالا بردن خوانایی، کلمات باید با استفاده از زیرخط از هم جدا شوند.

source: Variable names follow the same convention as function names.
fa: نام متغیرها از همان قواعد نامگذاری توابع پیروی می‌کند.

source: mixedCase is allowed only in contexts where that's already the prevailing style (e.g. threading.py), to retain backwards compatibility.
fa: استفاده از قاعدهٔ نگارشی mixedCase فقط در زمینه‌هایی مجاز است که قبلاً سبک غالب بوده است (مانند نام‌هایی که در ماژول threading.py استفاده شده است)، تا سازگاری با نسخه‌های پیشن را حفظ کند.

source: Function and Method Arguments
fa: آرگومان‌های توابع و متدها

source: Always use ``self`` for the first argument to instance methods.
fa: همیشه از ``self`` به عنوان آرگومان اول متدهای کلاس استفاده کنید.

source: Always use ``cls`` for the first argument to class methods.
fa: همیشه از ``cls`` به عنوان آرگومان اول متدهای نوع ``classmethod`` استفاده کنید.

source: If a function argument's name clashes with a reserved keyword, it is generally better to append a single trailing underscore rather than use an abbreviation or spelling corruption. Thus ``class_`` is better than ``clss``. (Perhaps better is to avoid such clashes by using a synonym.)
fa: یکسان بودن نام آرگومان‌های تابع با کلیدواژه‌های ذخیره شدهٔ هستهٔ پایتون، باعث به وجود آمدن ناسازگاری می‌شود. برای رفع این مشکل بهتر است یک زیرخط به انتهای نام آن آرگومان تابع افزوده شود. استفاده از زیرخط بهتر از مخفف کردن نام آرگومان است. برای نمونه، ``class_`` بهتر از ``clss`` است. (هرچند راه‌حل بهتر آن است که از نام‌هایی برای آرگومان‌ها استفاده شود که شبیه کلیدواژه‌های اصلی پایتون نباشند و از اساس این ناسازگاری به وجود نیاید.)

source: Method Names and Instance Variables
fa: نام متدها و متغیرهای کلاس
